Tekla.Structures.CatalogInternal.CatalogInternalOperation.DeleteUserParametricProfile(Tekla.Structures.Catalogs.ParametricProfileItem)
Deletes the user defined parametric profile item in the profile database
Returns: True on success.